import React from 'react';

const RefsGp = () => {
    return (
        <div>
            <div className="REFNAMERefsGP">
                Реферальные ссылки
            </div>
            <div className="MAPREFSGP">
                <div style={{display:"inline-flex"}}>
                    <svg style={{marginRight:"10px"}} width="22" height="22" viewBox="0 0 22 22" fill="none" xmlns="http://www.w3.org/2000/svg">
                        <path d="M5.89049 14.9912C5.20961 14.9858 4.54266 14.7978 3.95927 14.4467C3.37588 14.0956 2.89747 13.5943 2.57399 12.9951C2.23775 12.3839 2.06178 11.6975 2.0625 10.9999C2.06322 10.3023 2.24061 9.61629 2.57811 9.00578C2.90292 8.40745 3.38241 7.90729 3.96652 7.55755C4.55064 7.20781 5.21794 7.02131 5.89874 7.01753L10.0242 7.00103M5.68974 15.0035L9.64928 15.0448M16.1095 6.95474C16.7904 6.96007 17.4573 7.1481 18.0407 7.49922C18.6241 7.85033 19.1025 8.35163 19.426 8.95078C19.7622 9.56199 19.9382 10.2484 19.9375 10.946C19.9368 11.6436 19.7594 12.3296 19.4219 12.9401C19.0971 13.5385 18.6176 14.0386 18.0335 14.3884C17.4493 14.7381 16.782 14.9246 16.1012 14.9284L12.1412 14.8871M16.1425 6.96758L12.0175 6.98408M7.10691 10.8772H14.7762V10.9606H7.10691V10.8772Z" stroke="black" stroke-linecap="round" stroke-linejoin="round"/>
                    </svg>
                    (Прямая)
                </div>
                <div style={{marginRight:"30px",fontWeight:"14px",fontSize:"14px",color:"#7B7979"}}>33</div>
            </div>
        </div>
    );
};

export default RefsGp;
